---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures
source: html/a223ae03-a7fc-d7b0-a47b-728b254bbb1e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MechanicalFailures

Failures about HVAC.

## Syntax (C#)
```csharp
public static class MechanicalFailures
```